In [1]:
import pandas as pd
import numpy as np

In [10]:
file_path = "Employee_Attendance_Dataset (1).xlsx"
df = pd.read_excel(r"C:\Users\prerana\Downloads\Employee_Attendance_Dataset.xlsx")

df

   Employee_ID Employee_Name  Department  Days_Present  Total_Working_Days
0          201          Amit          HR            22                  26
1          202          Neha     Finance            20                  26
2          203          Ravi          IT            24                  26
3          204         Sneha          IT            23                  26
4          205         Karan  Operations            21                  26
5          206         Pooja          HR            22                  26
6          207         Rahul     Finance            19                  26
7          208         Anita   Marketing            20                  26
8          209        Vikram          IT            25                  26
9          210         Meena  Operations            18                  26

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         10 non-null     int64
 1   Employee_Name       10 non-null     object
 2   Department          10 non-null     object
 3   Days_Present        10 non-null     int64
 4   Total_Working_Days  10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [12]:
df["Attendance_Percentage"] = (df["Days_Present"] / df["Total_Working_Days"]) * 100
df

,Employee_ID,Employee_Name,Department,Days_Present,Total_Working_Days,Attendance_Percentage
0,201,Amit,HR,22,26,84.615385
1,202,Neha,Finance,20,26,76.923077
2,203,Ravi,IT,24,26,92.307692
3,204,Sneha,IT,23,26,88.461538
4,205,Karan,Operations,21,26,80.769231
5,206,Pooja,HR,22,26,84.615385
6,207,Rahul,Finance,19,26,73.076923
7,208,Anita,Marketing,20,26,76.923077
8,209,Vikram,IT,25,26,96.153846
9,210,Meena,Operations,18,26,69.230769

In [13]:
average_attendance = df["Attendance_Percentage"].mean()
max_attendance = df["Attendance_Percentage"].max()
min_attendance = df["Attendance_Percentage"].min()

print("Average Attendance Percentage:", round(average_attendance, 2))
print("Maximum Attendance Percentage:", round(max_attendance, 2))
print("Minimum Attendance Percentage:", round(min_attendance, 2))

Average Attendance Percentage: 82.31
Maximum Attendance Percentage: 96.15
Minimum Attendance Percentage: 69.23

In [14]:
dept_attendance = df.groupby("Department")["Attendance_Percentage"].mean()
dept_attendance

Department
Finance       75.000000
HR            84.615385
IT            92.307692
Marketing     76.923077
Operations    75.000000
Name: Attendance_Percentage, dtype: float64

In [15]:
low_attendance = df[df["Attendance_Percentage"] < 75]
low_attendance

,Employee_ID,Employee_Name,Department,Days_Present,Total_Working_Days,Attendance_Percentage
6,207,Rahul,Finance,19,26,73.076923
9,210,Meena,Operations,18,26,69.230769

In [16]:
output_file = "Employee_Attendance_Processed.xlsx"
df.to_excel(output_file, index=False)

print("Processed file saved successfully.")

Processed file saved successfully.

In [17]:
print("\nProgram execution completed.")

Program execution completed.

In [21]:
for i in range(1, 4):
    print("Processing completed... Step", i)

print("\nEnd of Employee Attendance Management System Program")

Processing completed... Step 1
Processing completed... Step 2
Processing completed... Step 3

End of Employee Attendance Management System Program

In [22]:
while True:
    choice = input("Do you want to exit the program? (yes/no): ").lower()
    if choice == "yes":
        print("Program terminated successfully.")
        break
    else:
        print("Program is still running...")

Do you want to exit the program? (yes/no):  yes

Program terminated successfully.